month = int(input('Введите месяц в числовом формате: '))
#  через словарь
seasons = {1: 'зима', 2: 'зима', 3: 'весна', 4: 'весна', 5: 'весна', 6: 'лето',
           7: 'лето', 8: 'лето', 9: 'осень', 10: 'осень', 11: 'осень', 12: 'зима'}
print(seasons[month])

#  через список
seasons_list = [1, 'зима', 2, 'зима', 3, 'весна', 4, 'весна', 5, 'весна', 6, 'лето',
           7, 'лето', 8, 'лето', 9, 'осень', 10, 'осень', 11, 'осень', 12, 'зима']
print(f'через список тоже {seasons_list[seasons_list.index(month)+1]}')
